Revit 2027 API
ParameterTypeId.StructuralBeamStartAttachmentDistance Property
 "Start Attachment Distance"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralBeamStartAttachmentDistance { get; }
Public Shared ReadOnly Property StructuralBeamStartAttachmentDistance As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralBeamStartAttachmentDistance {
	ForgeTypeId^ get ();
}
static member StructuralBeamStartAttachmentDistance : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace